src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>СтранаПроисхождения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПериодичностьУслуги</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПродукцияМаркируемаяДляГИСМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидСтавкиНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодРаздел7ДекларацииНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодконтрольнаяПродукцияВЕТИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТабачнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Импортер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКВЭД2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКПД2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесЕдиницы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппаГруппы</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МногооборотнаяТара</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВМесте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Номенклатура/ObjectModule.bsl
&Перед("ОбработкаПроверкиЗаполнения")
Процедура Базар_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидНоменклатуры = ПредопределенныеЭлементыРасширенияСервер.ПредопределенноеЗначениеРасширения("Справочник", "ВидыНоменклатуры", "Товары") тогда
		ПроверяемыеРеквизиты.Добавить("ВесЕдиницы");
		ПроверяемыеРеквизиты.Добавить("НоменклатурнаяГруппа");
	КонецЕсли;
	
	Если ВидНоменклатуры = ПредопределенныеЭлементыРасширенияСервер.ПредопределенноеЗначениеРасширения("Справочник", "ВидыНоменклатуры", "МногооборотнаяТара") тогда
		ПроверяемыеРеквизиты.Добавить("МногооборотнаяТара");
		ПроверяемыеРеквизиты.Добавить("МногооборотнаяТара.Номенклатура");
		ПроверяемыеРеквизиты.Добавить("МногооборотнаяТара.КоличествоВМесте");
	КонецЕсли;
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура Базар_ПередЗаписью(Отказ)
		
	СписокОшибок = Неопределено;
	
	Если НЕ ЭтоНовый() И НЕ ЭтоГруппа тогда
		КонтрольИзмененийВлияющихНаТовароДвижение(СписокОшибок);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(СписокОшибок, Отказ);
	
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура Базар_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Родитель") Тогда
		
		РеквизитыГруппы = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения.Родитель, 
			"НоменклатурнаяГруппаГруппы");
			
		Если НЕ ЗначениеЗаполнено(ВидНоменклатуры) Тогда
			НоменклатурнаяГруппа = РеквизитыГруппы.НоменклатурнаяГруппаГруппы;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура КонтрольИзмененийВлияющихНаТовароДвижение(СписокОшибок)
	
	//ТаблицаДокументов = ГосЗакупкиСервер.ТаблицаДокументовУчаствующихВДвиженияхГосЗакупокСУсловием("НоменклатураГосЗакупок", Ссылка);
	//	
	//Если ТаблицаДокументов.Количество() > 0 И ЕдиницаИзмерения <> Ссылка.ЕдиницаИзмерения тогда
	//	ТекстОшибки = "Нельзя изменять едницину измерения номенклатуры (гос. закупки), т.к. она участвует в движении товаров гос. закупок:";
	//	ГосЗакупкиКлиентСервер.СформироватьТекстСообщенияОписывающихДокументы(ТаблицаДокументов, ТекстОшибки);
	//	ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(СписокОшибок,
	//	                                                        "Объект.ЕдиницаИзмерения",
	//	                                                        ТекстОшибки,
	//															Неопределено);
	//КонецЕсли;
	//
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("СсылкаНаСтарыеДанные", Ссылка);
	//Запрос.УстановитьПараметр("НоваяТаблицаНоменклатуры", Номенклатура.Выгрузить());
	//
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	НоменклатураГосЗакупокНоменклатура.Номенклатура КАК Номенклатура,
	//|	НоменклатураГосЗакупокНоменклатура.Коэффициент КАК Коэффициент
	//|ПОМЕСТИТЬ ТаблицаНоменклатурыСтарая
	//|ИЗ
	//|	Справочник.НоменклатураГосЗакупок.Номенклатура КАК НоменклатураГосЗакупокНоменклатура
	//|ГДЕ
	//|	НоменклатураГосЗакупокНоменклатура.Ссылка = &СсылкаНаСтарыеДанные
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	НоменклатураГосЗакупокНоменклатура.Номенклатура,
	//|	НоменклатураГосЗакупокНоменклатура.Коэффициент
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВЫРАЗИТЬ(НоваяТаблицаНоменклатуры.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	//|	ВЫРАЗИТЬ(НоваяТаблицаНоменклатуры.Коэффициент КАК ЧИСЛО(10, 5)) КАК Коэффициент,
	//|	ВЫРАЗИТЬ(НоваяТаблицаНоменклатуры.НомерСтроки КАК ЧИСЛО(10, 0)) КАК НомерСтроки
	//|ПОМЕСТИТЬ ТаблицаНоменклатурыНовая
	//|ИЗ
	//|	&НоваяТаблицаНоменклатуры КАК НоваяТаблицаНоменклатуры
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ЕСТЬNULL(ТаблицаНоменклатурыСтарая.Номенклатура, ТаблицаНоменклатурыНовая.Номенклатура) КАК Номенклатура,
	//|	ЕСТЬNULL(ТаблицаНоменклатурыНовая.Коэффициент, 1) КАК КоэффициентНовый,
	//|	ЕСТЬNULL(ТаблицаНоменклатурыСтарая.Коэффициент, 1) КАК КоэффициентСтарый,
	//|	ЕСТЬNULL(ТаблицаНоменклатурыСтарая.Коэффициент, 1) <> ЕСТЬNULL(ТаблицаНоменклатурыНовая.Коэффициент, 1) КАК ЭтоИзменениеКоэффициента,
	//|	ТаблицаНоменклатурыНовая.Номенклатура ЕСТЬ NULL
	//|		И НЕ ТаблицаНоменклатурыСтарая.Номенклатура ЕСТЬ NULL КАК ЭтоУдалениеНоменклатуры,
	//|	ЕСТЬNULL(ТаблицаНоменклатурыНовая.НомерСтроки, 0) КАК НомерСтроки
	//|ПОМЕСТИТЬ НоменклатураДляПроверки
	//|ИЗ
	//|	ТаблицаНоменклатурыСтарая КАК ТаблицаНоменклатурыСтарая
	//|		ПОЛНОЕ СОЕДИНЕНИЕ ТаблицаНоменклатурыНовая КАК ТаблицаНоменклатурыНовая
	//|		ПО ТаблицаНоменклатурыСтарая.Номенклатура = ТаблицаНоменклатурыНовая.Номенклатура
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ЕСТЬNULL(ДанныеПервичныхДокументов.Документ, Базар_ДанныеПервичныхДокументов.Документ) КАК Документ,
	//|	ЕСТЬNULL(ДанныеПервичныхДокументов.Дата, Базар_ДанныеПервичныхДокументов.Дата) КАК Дата,
	//|	ЕСТЬNULL(ДанныеПервичныхДокументов.Номер, Базар_ДанныеПервичныхДокументов.Номер) КАК Номер
	//|ПОМЕСТИТЬ ДанныеПервичныхДокументов
	//|ИЗ
	//|	РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	//|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.Базар_ДанныеПервичныхДокументов КАК Базар_ДанныеПервичныхДокументов
	//|		ПО ДанныеПервичныхДокументов.Документ = Базар_ДанныеПервичныхДокументов.Документ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	НоменклатураДляПроверки.Номенклатура КАК Номенклатура,
	//|	НоменклатураДляПроверки.КоэффициентНовый КАК КоэффициентНовый,
	//|	НоменклатураДляПроверки.КоэффициентСтарый КАК КоэффициентСтарый,
	//|	НоменклатураДляПроверки.ЭтоИзменениеКоэффициента КАК ЭтоИзменениеКоэффициента,
	//|	НоменклатураДляПроверки.ЭтоУдалениеНоменклатуры КАК ЭтоУдалениеНоменклатуры,
	//|	НоменклатураДляПроверки.НомерСтроки КАК НомерСтроки
	//|ИЗ
	//|	НоменклатураДляПроверки КАК НоменклатураДляПроверки
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	НоменклатураДляПроверки.Номенклатура,
	//|	НоменклатураДляПроверки.ЭтоИзменениеКоэффициента,
	//|	НоменклатураДляПроверки.КоэффициентНовый,
	//|	НоменклатураДляПроверки.КоэффициентСтарый,
	//|	НоменклатураДляПроверки.НомерСтроки,
	//|	НоменклатураДляПроверки.ЭтоУдалениеНоменклатуры
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Номенклатура
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТоварыГосЗакупокОбороты.Номенклатура КАК Номенклатура,
	//|	ТоварыГосЗакупокОбороты.Регистратор КАК Документ,
	//|	ДанныеПервичныхДокументов.Дата КАК Дата,
	//|	ДанныеПервичныхДокументов.Номер КАК Номер
	//|ИЗ
	//|	РегистрНакопления.ТоварыГосЗакупок.Обороты(
	//|			,
	//|			,
	//|			Регистратор,
	//|			Номенклатура В
	//|				(ВЫБРАТЬ
	//|					НоменклатураДляПроверки.Номенклатура КАК Номенклатура
	//|				ИЗ
	//|					НоменклатураДляПроверки КАК НоменклатураДляПроверки)) КАК ТоварыГосЗакупокОбороты
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	//|		ПО ТоварыГосЗакупокОбороты.Регистратор = ДанныеПервичныхДокументов.Документ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ДанныеПервичныхДокументов.Дата,
	//|	ДанныеПервичныхДокументов.Номер,
	//|	ТоварыГосЗакупокОбороты.Номенклатура,
	//|	ТоварыГосЗакупокОбороты.Регистратор
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Дата,
	//|	Документ";
	//
	//ПакетРезультатов = Запрос.ВыполнитьПакет();
	//
	//ТаблицаОшибок = ПакетРезультатов.Получить(4).Выгрузить();
	//ТаблицаДокументов = ПакетРезультатов.Получить(5).Выгрузить();
	//	
	//Если ТаблицаОшибок.Количество() = 0 тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Для Каждого СтрокаОшибки из ТаблицаОшибок цикл
	//	
	//	Если СтрокаОшибки.ЭтоИзменениеКоэффициента тогда
	//		ТекстОшибки = "Нельзя изменять коэффициент пересчета номенклатуры ";
	//	ИначеЕсли СтрокаОшибки.ЭтоУдалениеНоменклатуры тогда
	//		ТекстОшибки = "Нельзя удалять номенклатуру ";
	//	Иначе
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	ТекстОшибки = ТекстОшибки + " """ + Строка(СтрокаОшибки.Номенклатура) +
	//	              """, т.к. она участвует в движении товаров гос. закупок:";
	//	
	//	Отборы = Новый Структура("Номенклатура", СтрокаОшибки.Номенклатура);
	//	СтрокиДокументов = ТаблицаДокументов.НайтиСтроки(Отборы);
	//	ГосЗакупкиКлиентСервер.СформироватьТекстСообщенияОписывающихДокументы(СтрокиДокументов, ТекстОшибки);
	//	
	//	Если СтрокаОшибки.ЭтоИзменениеКоэффициента тогда
	//		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(СписокОшибок,
	//		                                                        "Объект.Номенклатура[%1].Коэффициент",
	//		                                                        ТекстОшибки,
	//																Неопределено,
	//																СтрокаОшибки.НомерСтроки - 1);
	//	ИначеЕсли СтрокаОшибки.ЭтоУдалениеНоменклатуры тогда
	//		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(СписокОшибок,
	//		                                                        "Объект.Номенклатура",
	//		                                                        ТекстОшибки,
	//																Неопределено);
	//	КонецЕсли;
	//КонецЦикла;
	
КонецПроцедуры
